{"pageProps":{"data":{"title":"Bee Quest","description":"Bee Quest, is an asymmetric game optimized for HMD and Mobile, immersing players into the enchanting realm of the Honey Bee.","date":"2024-01-01","order":1,"tech":"threejs,react,ts","banner":" { \"src\" : \"/images/portfolio/games/BeeQuest/banner.jpg\", \"alt\":\"A 3d rendering of many cubes like Minecraft.\" } ","id":"BeeQuest"},"content":"\r\n#### About\r\n\r\n*Bee Quest* is an innovative asymmetric game, designed to bridge the experiences between Head-Mounted Display (HMD) and mobile platforms. It transports players into the enchanting world of honey bees, offering a dual experience: on mobile, players explore the real world to collect flowers, while on HMD, they can both gather resources and engage in battles against wasps. Regardless of the platform, managing the hive is a central aspect of gameplay, ensuring a cohesive experience across devices.\r\n\r\nAs the lead software architect for *Bee Quest*, developed for Niantic's 8th Wall Platform, I played a crucial role in bringing this immersive experience to life. My responsibilities spanned from overarching system design to the intricate details of gameplay mechanics, ensuring that both mobile and HMD users enjoy a seamless and engaging experience.\r\n\r\nLeveraging the capabilities of React Three Fiber, we were able to incorporate a variety of libraries that enhanced our development process. However, the unique demands of \"Bee Quest\" necessitated the creation of several custom components and systems. One of my significant contributions was the development of an Entity Component System from scratch. This system was fundamental in managing the game's complex mechanics in a modular way, where each entity—be it a bee, flower, or wasp—had its own logic and behaviors.\r\n\r\nTo facilitate the game's asymmetric nature and support seamless multiplayer interactions, I devised a hook-based system for state management. This system allowed for effortless synchronization of game states between players, enabling them to subscribe to updates and share their actions across the HMD and mobile platforms.\r\n\r\nMoreover, I took the lead in designing the user interfaces for both platforms, with a particular focus on the HMD experience. Creating intuitive and visually appealing UIs was a challenging but rewarding task, made smoother by the resources provided by @coconut-xr. Another intriguing challenge was engineering the hive cells' behavior and appearance, ensuring they aligned correctly and faced the player upon entry, with animations that brought the hive to life.\r\n\r\nThrough these efforts, *Bee Quest* delivers a captivating and immersive experience, allowing players to delve into the world of honey bees, whether they're adventuring outdoors on their mobile devices or engaging in the hive's management and defense on their HMDs.\r\n\r\n\r\n##### Technology Used\r\n\r\n- TypeScript\r\n- Babylon.Js\r\n- React\r\n- React Three Fiber\r\n- 8th Wall Platform\r\n- [@coconut-xr](https://github.com/coconut-xr)\r\n- WebPack\r\n\r\n#### Links\r\n\r\n[Play On 8th Wall](https://www.8thwall.com/codematt/beequest3)\r\n\r\n#### Screen Shots\r\n\r\n```RICHDATA\r\n{\r\n  \"type\": \"image-gallery\",\r\n  \"data\": {\r\n    \"gallery\": {\r\n      \"webP\" : true,\r\n      \"thumb\" : false,\r\n      \"popup\": false,\r\n      \"imageSize\": \"large\",\r\n      \"imageType\": \"post\"\r\n    },\r\n    \"images\": [\r\n      {\r\n        \"src\": \"/images/portfolio/games/BeeQuest/ScreenShots/1.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/BeeQuest/ScreenShots/2.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/BeeQuest/ScreenShots/3.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/BeeQuest/ScreenShots/4.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/BeeQuest/ScreenShots/5.jpg\"\r\n      }\r\n    ]\r\n  }\r\n}\r\n```\r\n\r\n#### Video\r\n\r\n[YT](https://www.youtube.com/embed/V5eS6AG6RXY?si=_ni1Ydzxr1zbkb3d)\r\n\r\n#### Presentation\r\n\r\n[google-slides](https://docs.google.com/presentation/d/e/2PACX-1vRfxWzZ-CYXGnn9ivFDEN8NiJinokGqXXmKmTFflptZnUzD-j3V_pqNd2G1mB59rkv8bAgo4-FJFXz3/embed?start=false&loop=false&delayms=3000)\r\n\r\n#### Linked In\r\n\r\n[linkedin-post](https://www.linkedin.com/embed/feed/update/urn:li:ugcPost:7161053232377581568)\r\n\r\n[linkedin-post](https://www.linkedin.com/embed/feed/update/urn:li:ugcPost:7156414741073027073)\r\n","id":"BeeQuest"},"__N_SSG":true}