{"pageProps":{"data":{"title":"Crystalline Bliss","description":"A unique 3D puzzle game that takes place inside many voxel worlds.","date":"2024-01-01","order":2,"tech":"babylonjs,webpack,electron,steam,node,ts","banner":" { \"src\" : \"/images/portfolio/games/CrystallineBliss/banner.jpg\", \"alt\":\"A 3d rendering of many cubes like Minecraft.\" } ","id":"CrystallineBliss"},"content":"\r\n#### About\r\n\r\n*Crystalline Bliss* is a unique 3D puzzle game that unfolds across various voxel worlds. The game features two modes: peaceful and competitive. In peaceful mode, you place and clear crystals without any disturbances. In competitive mode, both bad and good events can be triggered by clearing crystals. The events can affect you and other players. These events can either assist in clearing your board or make it more challenging. Additionally, there's a special type of crystal that activates effects, altering the characteristics of the generated crystal sets. There are several of these effects; for instance, one might make your crystal set extremely small or large, another could randomly change some of the crystals to a different type, and another might transform your set into a different type altogether. The outcomes of these effects vary depending on their order.\r\n\r\nI developed *Crystalline Bliss* mostly from scratch and released it on Steam. I created all the textures and music, while my sound designer friend, Tyler Quinn, handled the sound effects and served as the voice of the announcer.\r\n\r\nThe game employs the Divine Voxel Engine for texture and shader management. However, unlike typical implementations, the worlds are pre-generated, saved in a custom format that I devised. Levels are read in, decompressed, and each chunk's mesh buffer is sent to a thread for decompression before being forwarded to the main thread. The level buffers are stored in IndexedDB. This approach proved to be the fastest for level switching and storage for the time being.\r\n\r\nOne of the game's more complex challenges was developing AI for computer opponents. I offloaded their logic to a separate thread, as each AI must process extensive data to determine the optimal placement for the current crystal set. After identifying the best location, it calculates a path to that point and sends this path back to the main thread.\r\n\r\nI also crafted my own multiplayer system using WebRTC, building a custom signaling server to connect players. Communication is streamlined through the use of array buffers via WebRTC's data channels. Multiplayer has not been officially released but is expected to launch soon.\r\n\r\n\r\n##### Technology Used\r\n\r\n- TypeScript\r\n- Babylon.Js\r\n- Steam\r\n- Electron\r\n- NodeJs\r\n- WebPack\r\n\r\n\r\n#### Links\r\n\r\n- [Steam Page](https://store.steampowered.com/app/2547740/Crystalline_Bliss/)\r\n- [WebSite](https://crystallinebliss.dev/)\r\n- [Demo](https://crystallinebliss.dev/beta/)\r\n\r\n#### Screen Shots\r\n```RICHDATA\r\n{\r\n  \"type\": \"image-gallery\",\r\n  \"data\": {\r\n    \"gallery\": {\r\n      \"webP\" : true,\r\n      \"thumb\" : false,\r\n      \"popup\": false,\r\n      \"imageSize\": \"large\",\r\n      \"imageType\": \"post\"\r\n    },\r\n    \"images\": [\r\n      {\r\n        \"src\": \"/images/portfolio/games/CrystallineBliss/ScreenShots/1.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/CrystallineBliss/ScreenShots/2.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/CrystallineBliss/ScreenShots/3.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/CrystallineBliss/ScreenShots/4.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/CrystallineBliss/ScreenShots/5.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/CrystallineBliss/ScreenShots/6.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/CrystallineBliss/ScreenShots/7.jpg\"\r\n      },\r\n      {\r\n        \"src\": \"/images/portfolio/games/CrystallineBliss/ScreenShots/8.jpg\"\r\n      }\r\n    ]\r\n  }\r\n}\r\n```\r\n\r\n\r\n#### Video\r\n\r\n[YT](https://www.youtube.com/embed/-Gm7bilVDY8?si=jDtpPSJNXAkQdkV4)\r\n\r\n\r\n","id":"CrystallineBliss"},"__N_SSG":true}