{"pageProps":{"content":"### Experience \r\n\r\n#### Indie Dev\r\n\r\nDivine Star LLC - Hastings, MI\r\n\r\n2019 to Present\r\n\r\n- Created an indie project called Divine Star Software. \r\n- Created and released a game to Steam called Crystalline Bliss. \r\n- Created several open source libraries such as Divine Voxel Engine. \r\n- Worked with other companies consulting them on writing performant 3d code for the web.\r\n\r\n#### XR Game Developer\r\n\r\nNiantic - Contract - Remote\r\n\r\nApril 2023 to June 2023\r\n\r\n- Contracted by Niantic to build an XR game using react three fiber for their 8th Wall Platform\r\n- Built a custom entity component system for react three fiber and implemented multi-player.\r\n- Worked with a team of artist and game designers to produce a final product.\r\n\r\n#### Senior Software Engineer\r\n\r\nBitreel - Remote\r\n\r\nApril 2023 to June 2023\r\n\r\n- Architected a high performance 3D React application.  \r\n- Improved the speed greatly, stopped crashes, and brought the memory usage way down.\r\n- Built a custom in-memory multi-threaded mesh database. \r\n- Engineered a multi-threaded indexDB library to handle caching and loading meshes.\r\n\r\n#### Programming Consultant\r\n\r\nBitreel - Remote\r\n\r\nNovember 2022 to April 2023\r\n\r\n- Helped convert JavaScript codebase to a TypeScript codebase. \r\n- Helped engineer a system to load in high fidelity meshes in from a thread pool to populate a digital retail space. \r\n- Provided software structure planning and guidance.\r\n\r\n#### Web Developer\r\n\r\nEtools - Remote\r\n\r\nFeburary 2022 to Feburary 2023\r\n\r\n- Worked directly with their top clients to make websites and manage their data\r\n- Built eCommerce sites for their clients.\r\n- Developed custom solutions to resolve data issues and increase sales.\r\n\r\n#### Web Programmer\r\n\r\nUniversity Marketing and Communications at Michigan Technological University - Houghton, MI\r\n\r\n2017 to 2020\r\n\r\n- Worked in a professional environment with graphic designers, writers, videographers, and web developers.\r\n- Help them move from an old CMS to an XSLT/PHP based CMS called OU Campus. Developed a PHP script to export content to make the process easier.\r\n- Built new and expand upon features for their CMS. Rebuilt their image cropping gadget and built utility gadgets for management.\r\n- Worked to implement AA web accessibility standers compliance in each project and site.\r\n- Constructed web pages and web apps that interacted with MySQL databases and or Google Sheets.\r\n- Worked with groups and university departments to add features or improve their sites.\r\n\r\n#### Media Specialist\r\n\r\nUniversity Marketing and Communications at Michigan Technological University - Houghton, MI\r\n\r\nJune 2017 to November 2018\r\n\r\n- Worked with a videographer to make marketing material for Michigan Tech.\r\n- Recorded and edited videos in the Adobe Suite.\r\n- Used Adobe After effects and Illustrator to make basic animations and effects.\r\n- Worked with a team of people to make a consistent image and message.\r\n- Assisted in video archiving and storage management.\r\n\r\n---\r\n\r\n### Education\r\n\r\n##### Associate in Humanities \r\n\r\n###### Minor in Computer Science\r\n\r\nMichigan Technological University - Houghton, MI\r\n\r\n2015 to 2020\r\n\r\n- 3.6 Departmental GPA \r\n- 3.5 Overall GPA\r\n- Completed a minor In Computer Science. \r\n- Took courses related to sound design, music, communication,and software development.\r\n- Completed over 130 credits. \r\n\r\n"},"__N_SSG":true}