{"pageProps":{"data":{"title":"All Games","description":"An overview of some past game projects.","date":"2020-10-01","order":4,"tech":"","banner":" { \"src\" : \"/images/portfolio/games/AllGames/banner.jpg\", \"alt\":\"A 3d rendering of many cubes like Minecraft.\" } ","id":"AllGames"},"content":"\r\n- [About](#About)\r\n- [Games](#Games)\r\n  - [Orbital Drift](#Orbital-Drift)\r\n  - [Turn Based RPG Engine](#Turn-Based-RPG-Engine)\r\n  - [Lua Love2D Turn Based RPG](#Lua-Love2D-Turn-Based-RPG)\r\n\r\n#### About\r\n\r\nI got into programming because I really wanted to make video games. I started teaching myself when I was around 12 years old. I begged my dad to buy me Game Maker 7. I worked hard on our Windows Vista computer for years teaching myself the basics of programming and game development. By the time I had left for college I had made several games  in Game Maker. Video games take a lot of time and effort and for me they are a labor of love. Honestly I don’t play video games very much. I’ve probably spent more time working on them then playing them. I love the complexity and the intense amount of systemic thinking you have to do.\r\n\r\nBelow are some past project of mine. All I have for the Game Maker games is the Game Maker files and executables so I won’t share the code here. But for the Love2D game all the code is on GitHub. These are not all the games I made over the years but they are the ones I feel comfortable sharing.\r\n\r\n#### Games\r\n\r\n##### Orbital Drift\r\n\r\nWhen I was in college I was part of an enterprise group called “Husky Game Development”. This is a trailer I made for the game my group worked on. The game was made in Unity.\r\n\r\nI created the video for it also. The video was all made in Adobe After Effects. \r\n\r\n[YT](https://www.youtube.com/embed/i7EvoLs5BCE)\r\n\r\n##### Turn Based RPG Engine\r\n\r\nI made an engine for a turn-based RPG game. This game complete with an inventory system, a leveling up system, and item pickup system, a quest system, store system, and an NPC system. I made this when I was about 18. It is all done in Game Maker 8.1.\r\n\r\n[YT](https://www.youtube.com/embed/2X6lMgmvV04)\r\n\r\n##### Lua Love2D Turn Based RPG\r\n\r\nThis was a turn-based RPG game that I was making with Love2D and Lua. I am actually still making a turn-based RPG in the Babylon.js game engine now. I am using what I learned to make this in making the other one. I will probably not finish this because of the other project. But I learned a lot from making it.\r\n\r\n[View On GitHub](https://github.com/lucasdamianjohnson/turnbasedrpglove2d)\r\n\r\n[YT](https://www.youtube.com/embed/0G5PH-Hw4nE)\r\n\r\n","id":"AllGames"},"__N_SSG":true}